Revit 2027 API
ExporterIFCUtils.GetTransformForDoorOrWindow Method
 Obtains the transform for the door or window instance.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform GetTransformForDoorOrWindow(
	FamilyInstance familyInstance,
	FamilySymbol familySymbol,
	bool flippedX,
	bool flippedY
)
Public Shared Function GetTransformForDoorOrWindow (
	familyInstance As FamilyInstance,
	familySymbol As FamilySymbol,
	flippedX As Boolean,
	flippedY As Boolean
) As Transform
public:
static Transform^ GetTransformForDoorOrWindow(
	FamilyInstance^ familyInstance,
	FamilySymbol^ familySymbol,
	bool flippedX,
	bool flippedY
)
static member GetTransformForDoorOrWindow :
        familyInstance : FamilyInstance *
        familySymbol : FamilySymbol *
        flippedX : bool *
        flippedY : bool -> Transform
Parameters
familyInstance FamilyInstance
 The family instance.
familySymbol FamilySymbol
 The family symbol.
flippedX Boolean
 Is the door or window flipped in X?
flippedY Boolean
 Is the door or window flipped in Y?
Return Value
Transform
 The transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace